In [1]:
def square(x):
    return x**2

def cube(x):
    return x**3

def power(x,p):
    return x**p

def print_me(x):
    print(x)

In [2]:
import pandas as pd

In [4]:
df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[2,3,4,5]
})
df

   col1  col2
0     1     2
1     2     3
2     3     4
3     4     5

In [5]:
df.apply(print_me)

0    1
1    2
2    3
3    4
Name: col1, dtype: int64
0    2
1    3
2    4
3    5
Name: col2, dtype: int64

col1    None
col2    None
dtype: object

In [6]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [7]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [8]:
df['col1'].apply(cube)

0     1
1     8
2    27
3    64
Name: col1, dtype: int64

In [9]:
df['col1'].apply(power,p=5)

0       1
1      32
2     243
3    1024
Name: col1, dtype: int64

In [10]:
def average(col):
        x=col[0]
        y=col[1]
        z=col[2]
        w=col[3]
        return (x+y+z+w)/4

In [12]:
df.apply(average)

col1    2
col2    3
dtype: int64

In [20]:
import numpy as np
df.apply(np.sum)

col1    10
col2    14
dtype: int64

In [23]:
df.apply(np.mean)

col1    2.5
col2    3.5
dtype: float64


# Seaborn manipulation

In [26]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [27]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [28]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [43]:
def cnt_missing(cols):
    null_vector=pd.isnull(cols)
    null_counts=np.sum(null_vector)
    return null_counts

def prop_missing(cols):
    total_nulls=cnt_missing(cols)
    size_cols = len(cols)
    value=float(total_nulls)/float(size_cols)
    return value

def prop_notnull(cols):
    return 1-prop_missing(cols)

In [44]:
titanic.apply(cnt_missing)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [45]:
titanic.apply(prop_missing)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [46]:
titanic.apply(prop_notnull)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [56]:
titanic['age'].value_counts(dropna=False)

NaN       177
 24.00     30
 22.00     27
 18.00     26
 28.00     25
 19.00     25
 30.00     25
 21.00     24
 25.00     23
 36.00     22
 29.00     20
 32.00     18
 26.00     18
 35.00     18
 27.00     18
 16.00     17
 31.00     17
 34.00     15
 23.00     15
 33.00     15
 20.00     15
 39.00     14
 17.00     13
 42.00     13
 40.00     13
 45.00     12
 38.00     11
 50.00     10
 2.00      10
 4.00      10
         ...
 28.50      2
 63.00      2
 0.83       2
 30.50      2
 70.00      2
 57.00      2
 0.75       2
 13.00      2
 59.00      2
 10.00      2
 64.00      2
 40.50      2
 45.50      2
 32.50      2
 20.50      1
 24.50      1
 0.67       1
 70.50      1
 0.92       1
 74.00      1
 34.50      1
 14.50      1
 80.00      1
 12.00      1
 53.00      1
 36.50      1
 55.50      1
 66.00      1
 23.50      1
 0.42       1
Name: age, Length: 89, dtype: int64

In [57]:
titanic['age'].fillna(method='ffill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5      35.0
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      2.0
18     31.0
19     31.0
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26     38.0
27     19.0
28     19.0
29     19.0
       ...
861    21.0
862    48.0
863    48.0
864    24.0
865    42.0
866    27.0
867    31.0
868    31.0
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878    19.0
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [59]:
titanic['age'].mean()

29.69911764705882